# Data Engineering: Lab 02
---------------

### Task 01: Create data frame called df_beers containing 5 names of beers, their type, alcohol value, and the brewing company.

In [1]:
import pandas as pd

df_beers = pd.DataFrame({'name': ['Suri Hugo', 'Das Bier', 'Test Bier', 'Bierman', 'Kopfab'], 'type': ['Sauerbier', 'Weizenbier', 'Weizenbier', 'Weizenbier', 'Weizenbier'], 'alcohol': [5.2, 5.1, 5, 1, 2], 'company': ['Sauer AG', 'Heineken', 'Heineken', 'Heineken', 'Heineken']})
df_beers

/var/folders/g8/ts4wj2w128q2scsf9ttnhwq40000gn/T/ipykernel_40437/3728011278.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

        name        type  alcohol   company
0  Suri Hugo   Sauerbier      5.2  Sauer AG
1   Das Bier  Weizenbier      5.1  Heineken
2  Test Bier  Weizenbier      5.0  Heineken
3    Bierman  Weizenbier      1.0  Heineken
4     Kopfab  Weizenbier      2.0  Heineken

### Task 02: Creating a dataframe from csv

##### a) Create a DataFrame called meteorites with the meteorite_landings.csv file.

In [4]:
meteorites = pd.read_csv('DE_Lab02_WorkingWithData_meteorite_landings.csv')
meteorites

,Aachen,Valid,L5,21,Fell,01/01/1880 12:00:00 AM,1,50.775,6.08333
0,Aarhus,Valid,H6,720.0,Fell,01/01/1951 12:00:00 AM,2,56.18333,10.23333
1,Abee,Valid,EH4,107000.0,Fell,01/01/1952 12:00:00 AM,6,54.21667,-113.00000
2,Acapulco,Valid,Acapulcoite,1914.0,Fell,01/01/1976 12:00:00 AM,10,16.88333,-99.90000
3,Achiras,Valid,L6,780.0,Fell,01/01/1902 12:00:00 AM,370,-33.16667,-64.95000
4,Adhi Kot,Valid,EH4,4239.0,Fell,01/01/1919 12:00:00 AM,379,32.10000,71.80000
...,...,...,...,...,...,...,...,...,...
45710,Zillah 002,Valid,Eucrite,172.0,Found,01/01/1990 12:00:00 AM,31356,29.03700,17.01850
45711,Zinder,Valid,Pallasite & ungrouped,46.0,Found,01/01/1999 12:00:00 AM,30409,13.78333,8.96667
45712,Zlin,Valid,H4,3.3,Found,01/01/1939 12:00:00 AM,30410,49.25000,17.66667
45713,Zubkovsky,Valid,L6,2167.0,Found,01/01/2003 12:00:00 AM,31357,49.78917,41.50460
45714,Zulu Queen,Valid,L3.7,200.0,Found,01/01/1976 12:00:00 AM,30414,33.98333,-115.68333

##### b) Print the top5 entries of your DataFrame and check if everything is ok. What information is missing?

In [5]:
meteorites.head(5) # All column names are missing

,Aachen,Valid,L5,21,Fell,01/01/1880 12:00:00 AM,1,50.775,6.08333
0,Aarhus,Valid,H6,720.0,Fell,01/01/1951 12:00:00 AM,2,56.18333,10.23333
1,Abee,Valid,EH4,107000.0,Fell,01/01/1952 12:00:00 AM,6,54.21667,-113.00000
2,Acapulco,Valid,Acapulcoite,1914.0,Fell,01/01/1976 12:00:00 AM,10,16.88333,-99.90000
3,Achiras,Valid,L6,780.0,Fell,01/01/1902 12:00:00 AM,370,-33.16667,-64.95000
4,Adhi Kot,Valid,EH4,4239.0,Fell,01/01/1919 12:00:00 AM,379,32.10000,71.80000

##### c) Create the DataFrame again with the missing information and print the top5 entries.

In [8]:
meteorites = pd.read_csv('DE_Lab02_WorkingWithData_meteorite_landings.csv', names=['Name', 'Validity', 'Type', 'Weight (g)', 'Fall', 'Year', 'ID', 'Lat', 'Long'])
meteorites

,Name,Validity,Type,Weight (g),Fall,Year,ID,Lat,Long
0,Aachen,Valid,L5,21.0,Fell,01/01/1880 12:00:00 AM,1,50.77500,6.08333
1,Aarhus,Valid,H6,720.0,Fell,01/01/1951 12:00:00 AM,2,56.18333,10.23333
2,Abee,Valid,EH4,107000.0,Fell,01/01/1952 12:00:00 AM,6,54.21667,-113.00000
3,Acapulco,Valid,Acapulcoite,1914.0,Fell,01/01/1976 12:00:00 AM,10,16.88333,-99.90000
4,Achiras,Valid,L6,780.0,Fell,01/01/1902 12:00:00 AM,370,-33.16667,-64.95000
...,...,...,...,...,...,...,...,...,...
45711,Zillah 002,Valid,Eucrite,172.0,Found,01/01/1990 12:00:00 AM,31356,29.03700,17.01850
45712,Zinder,Valid,Pallasite & ungrouped,46.0,Found,01/01/1999 12:00:00 AM,30409,13.78333,8.96667
45713,Zlin,Valid,H4,3.3,Found,01/01/1939 12:00:00 AM,30410,49.25000,17.66667
45714,Zubkovsky,Valid,L6,2167.0,Found,01/01/2003 12:00:00 AM,31357,49.78917,41.50460
45715,Zulu Queen,Valid,L3.7,200.0,Found,01/01/1976 12:00:00 AM,30414,33.98333,-115.68333

### Task 03: Extracting subsets

##### a) Use the query method to extract the meteorites with mass(g) greater then 50000.

In [11]:
meteorites[meteorites['Weight (g)'] > 5000]

,Name,Validity,Type,Weight (g),Fall,Year,ID,Lat,Long
2,Abee,Valid,EH4,107000.0,Fell,01/01/1952 12:00:00 AM,6,54.21667,-113.00000
7,Agen,Valid,H5,30000.0,Fell,01/01/1814 12:00:00 AM,392,44.21667,0.61667
11,AÃ¯r,Valid,L6,24000.0,Fell,01/01/1925 12:00:00 AM,424,19.08333,8.38333
16,Akyumak,Valid,Iron & IVA,50000.0,Fell,01/01/1981 12:00:00 AM,433,39.91667,42.81667
19,Alais,Valid,CI1,6000.0,Fell,01/01/1806 12:00:00 AM,448,44.11667,4.08333

##### b) Use the query method to extract the meteorites with mass(g) greater then 50000 and fall equals 'Fell' and nametype equals 'Valid'.

In [14]:
meteorites[(meteorites['Weight (g)'] > 5000) & (meteorites.Fall == 'Fell') & (meteorites.Validity == 'Valid')]

,Name,Validity,Type,Weight (g),Fall,Year,ID,Lat,Long
2,Abee,Valid,EH4,107000.0,Fell,01/01/1952 12:00:00 AM,6,54.21667,-113.00000
7,Agen,Valid,H5,30000.0,Fell,01/01/1814 12:00:00 AM,392,44.21667,0.61667
11,AÃ¯r,Valid,L6,24000.0,Fell,01/01/1925 12:00:00 AM,424,19.08333,8.38333
16,Akyumak,Valid,Iron & IVA,50000.0,Fell,01/01/1981 12:00:00 AM,433,39.91667,42.81667
19,Alais,Valid,CI1,6000.0,Fell,01/01/1806 12:00:00 AM,448,44.11667,4.08333
...,...,...,...,...,...,...,...,...,...
1097,Zavid,Valid,L6,95000.0,Fell,01/01/1897 12:00:00 AM,30396,44.40000,19.11667
1099,Zemaitkiemis,Valid,L6,44100.0,Fell,01/01/1933 12:00:00 AM,30399,55.30000,25.00000
1100,Zhaodong,Valid,L4,42000.0,Fell,01/01/1984 12:00:00 AM,30404,45.81667,125.91667
1101,Zhovtnevyi,Valid,H6,107000.0,Fell,01/01/1938 12:00:00 AM,30407,47.58333,37.25000
1104,Zomba,Valid,L6,7500.0,Fell,01/01/1899 12:00:00 AM,30412,-15.18333,35.28333

##### c) Use the query method to extract the meteorites with mass(g) greater then 100000 and the substring 'ur' in the name.

In [15]:
meteorites[(meteorites['Weight (g)'] > 100000) & (meteorites.Name.str.contains('ur'))]

,Name,Validity,Type,Weight (g),Fall,Year,ID,Lat,Long
120,BjurbÃ¶le,Valid,L/LL4,330000.0,Fell,01/01/1899 12:00:00 AM,5064,60.40000,25.80000
149,Bur-Gheluai,Valid,H5,120000.0,Fell,01/01/1919 12:00:00 AM,5169,5.00000,48.00000
5089,Bitburg,Valid,Iron & IAB complex,1500000.0,Found,01/01/1805 12:00:00 AM,5062,49.96667,6.53333
5220,Buenaventura,Valid,Iron & IIIAB,113600.0,Found,01/01/1969 12:00:00 AM,5162,29.80000,-107.55000
5224,Bur-Abor,Valid,Iron & IIIAB,290000.0,Found,01/01/1997 12:00:00 AM,5166,3.98333,41.65000
5575,Cranbourne,Valid,Iron & IAB-MG,8600000.0,Found,01/01/1854 12:00:00 AM,5463,-38.10000,145.30000
9179,Durango,Valid,Iron & IIIAB,164000.0,Found,01/01/1804 12:00:00 AM,7751,NaN,NaN
16368,Henbury,Valid,Iron & IIIAB,2000000.0,Found,01/01/1931 12:00:00 AM,11872,-24.56667,133.16667
16525,Itapuranga,Valid,Iron & IAB-MG,628000.0,Found,NaN,12057,-15.58333,-50.15000
17451,Lake Murray,Valid,Iron & IIAB,270000.0,Found,01/01/1933 12:00:00 AM,12446,34.10000,-97.00000
22879,Magura,Valid,Iron & IAB-MG,150000.0,Found,01/01/1840 12:00:00 AM,15388,49.33333,19.48333
26207,Mount Padbury,Valid,Mesosiderite-A1,272000.0,Found,01/01/1964 12:00:00 AM,16785,-25.66667,118.10000
26317,Murnpeowie,Valid,Iron & IC,1143000.0,Found,01/01/1909 12:00:00 AM,16878,-29.58333,139.90000
37418,Scurry,Valid,H5,118000.0,Found,01/01/1937 12:00:00 AM,23468,32.50000,-101.00000

### Task 04:  Working with the dataframe

##### a) Add a column with the name 'just_year' which contains only the year of the 'year' column.

In [28]:
meteorites['just_year'] = meteorites.Year.str.replace(r'\d{2}\/\d{2}\/', '', regex=True).replace(r'\s\d{2}:\d{2}:\d{2}\s(A|P)M', '', regex=True)
meteorites.just_year.head()

0    1880
1    1951
2    1952
3    1976
4    1902
Name: just_year, dtype: object

##### b) Then add a column 'age', which contains the difference of the current year and the data in the 'just_year' column. For all entries with NaN in the year column set the age to 0.

In [40]:
import datetime
meteorites['age'] = 0
meteorites.just_year = pd.to_numeric(meteorites.just_year)
meteorites['age'] = datetime.datetime.now().year - meteorites.just_year
meteorites.age

0        144
1         73
2         72
3         48
4        122
        ...
45711     34
45712     25
45713     85
45714     21
45715     48
Name: age, Length: 45716, dtype: int64

### Task 05: Reading
Take your list of the top12 most important and interesting sections of the ebook "97 Things Every Data Engineer Should Know". Read the next top3 sections of your list and write down the most important points of the section with three bullet points each.